ansible_cucm/cucmv2/roles/CUCM_axl_setup/files/AxlCmds/AXL_addAppUser.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/11.5">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:addAppUser sequence="?">
         <appUser>
            <userid>AXLUser</userid>
            <password>fsp-WWcs!1</password>
            <associatedGroups>
               <userGroup>
                  <name>Standard Audit Users</name>
               </userGroup>
               <userGroup>
                  <name>Standard CCM Super Users</name>
               </userGroup>
            </associatedGroups>
         </appUser>
      </ns:addAppUser>
   </soapenv:Body>
</soapenv:Envelope>
